---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseB
source: html/861816a3-6960-1f88-0b27-629f621efd31.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseB Property

The ApparentCurrentPhaseB value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentCurrentPhaseB { get; }
```

## Remarks
This property is used to retrieve the ApparentCurrentPhaseB value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!